nc: 1

depth_multiple: 0.33
width_multiple: 0.125
max_channels: 512

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, ConvTranspose, [64, 64]] # 1-P2/4
  - [-1, 1, C2f, [128]]
  - [-1, 1, ConvTranspose, [128, 128]] # 3-P3/8
  - [-1, 2, C2f, [256]]
  - [-1, 1, ConvTranspose, [256, 256]] # 5-P4/16
  - [-1, 2, C2f, [512]]
  - [-1, 1, ConvTranspose, [512, 512]] # 7-P5/32
  - [-1, 1, C2f, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, GhostConv, [512, 512]] # 11
  - [-1, 1, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, GhostConv, [256, 256]] # 14
  - [-1, 1, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, ConvTranspose, [256, 256]] # 16
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 1, GhostConv, [512, 512]] # 18
  - [-1, 1, C2f, [512]] # 19 (P4/16-medium)
  - [-1, 1, ConvTranspose, [512, 512]] # 20
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 1, GhostConv, [1024, 1024]] # 22
  - [-1, 3, C2f, [1024]] # 23 (P5/32-large)

  - [[17, 21, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)
