nc: 1
groups: 8

depth_multiple: 0.33
width_multiple: 0.125
max_channels: 1024

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, PDWConvGrouped, [128, 3, 4, 2, 1]] # 1-P2/4, with padding 1 to maintain spatial size
  - [-1, 1, PDWFasterNetGrouped, [128, 4]]
  - [-1, 1, PDWConvGrouped, [256, 3, 4, 2, 1]] # 3-P3/8, with padding 1 to maintain spatial size
  - [-1, 2, PDWFasterNetGrouped, [256, 4]]
  - [-1, 1, PDWConvGrouped, [512, 3, 4, 2, 1]] # 5-P4/16, with padding 1 to maintain spatial size
  - [-1, 2, PDWFasterNetGrouped, [512, 4]]
  - [-1, 1, PDWConvGrouped, [1024, 3, 4, 2, 1]] # 7-P5/32, with padding 1 to maintain spatial size
  - [-1, 1, PDWFasterNetGrouped, [1024, 4]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  # - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 1, PDWFasterNetGrouped, [512, 4]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  # - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 1, PDWFasterNetGrouped, [256, 4]] # 15 (P3/8-small)

  - [-1, 1, PDWConvGrouped, [256, 3, 4, 2, 1]] # with padding 1 to maintain spatial size
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  # - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 1, PDWFasterNetGrouped, [512, 4]] # 18 (P4/16-medium)

  - [-1, 1, PDWConvGrouped, [512, 3, 4, 2, 1]] # with padding 1 to maintain spatial size
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  # - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 3, PDWFasterNetGrouped, [1024, 4]] # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
