nc: 2

depth_multiple: 0.33
width_multiple: 0.125
max_channels: 1024

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  # - [-1, 1, Fire, [16, 64, 64]] # 1-P2/4, with padding 1 to maintain spatial size
  - [-1, 1, LightConv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  # - [-1, 1, Fire, [32, 128, 128]] # 3-P3/8, with padding 1 to maintain spatial size
  - [-1, 1, LightConv, [256, 3, 2]] # 3-P3/8
  - [-1, 3, C2f, [256, True]]
  # - [-1, 1, Fire, [64, 256, 256]] # 5-P4/16, with padding 1 to maintain spatial size
  - [-1, 1, LightConv, [512, 3, 2]] # 5-P4/16
  - [-1, 3, C2f, [512, True]]
  # - [-1, 1, Fire, [128, 512, 512]] # 7-P5/32, with padding 1 to maintain spatial size
  - [-1, 1, LightConv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 3, C2f, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 3, C2f, [256, True]]

  # - [-1, 1, Fire, [64, 512, 512]] # with padding 1 to maintain spatial size
  - [-1, 1, LightConv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 3, C2f, [512, True]]

  # - [-1, 1, Fire, [32, 256, 256]] # with padding 1 to maintain spatial size
  - [-1, 1, LightConv, [128, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 3, C2f, [1024, True]]

  - [[17, 21, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)
