nc: 1

depth_multiple: 0.33
width_multiple: 0.125
max_channels: 1024

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, DWSConv, [128, 3, 2, 1]] # 1-P2/4, with padding 1 to maintain spatial size
  - [-1, 1, PDWFasterNet, [128]]
  - [-1, 1, DWSConv, [256, 3, 2, 1]] # 3-P3/8, with padding 1 to maintain spatial size
  - [-1, 2, PDWFasterNet, [256]]
  - [-1, 1, DWSConv, [512, 3, 2, 1]] # 5-P4/16, with padding 1 to maintain spatial size
  - [-1, 2, PDWFasterNet, [512]]
  - [-1, 1, DWSConv, [1024, 3, 2, 1]] # 7-P5/32, with padding 1 to maintain spatial size
  - [-1, 1, PDWFasterNet, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 1, PDWFasterNet, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 1, PDWFasterNet, [256]] # 15 (P3/8-small)

  - [-1, 1, ConvTranspose, [256, 3, 2, 1]] # with padding 1 to maintain spatial size
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 1, PDWFasterNet, [512]] # 18 (P4/16-medium)

  - [-1, 1, ConvTranspose, [512, 3, 2, 1]] # with padding 1 to maintain spatial size
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 3, PDWFasterNet, [1024]] # 21 (P5/32-large)

  - [[17, 21, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)
